In [ ]:
import pylab
from pylab import *

In [3]:
import pandas as pd
df = pd.read_csv(r'C:\Users\Stanzoman\Documents\projects\baby-names.csv')
df.head()

   year     name   percent  sex
0  1880     John  0.081541  boy
1  1880  William  0.080511  boy
2  1880    James  0.050057  boy
3  1880  Charles  0.045167  boy
4  1880   George  0.043292  boy

In [7]:
df.tail()

        year      name   percent   sex
257995  2008  Carleigh  0.000128  girl
257996  2008     Iyana  0.000128  girl
257997  2008    Kenley  0.000127  girl
257998  2008    Sloane  0.000127  girl
257999  2008   Elianna  0.000127  girl

In [6]:
#display from and to a certain index
df[3:9]

   year     name   percent  sex
3  1880  Charles  0.045167  boy
4  1880   George  0.043292  boy
5  1880    Frank  0.027380  boy
6  1880   Joseph  0.022229  boy
7  1880   Thomas  0.021401  boy
8  1880    Henry  0.020641  boy

In [12]:
#displaying by row and column
df.ix[2:4, ['year', 'name']]

   year     name
2  1880    James
3  1880  Charles
4  1880   George

In [14]:
#creating boy names and girl names datasets
#df['sex']=='girl'
girl_names = df[df['sex']=='girl']
boy_names = df[df['sex']=='boy']
boy_names.tail()

        year    name   percent  sex
128995  2008  Kolten  0.000090  boy
128996  2008  Damari  0.000089  boy
128997  2008    Hugh  0.000089  boy
128998  2008  Jensen  0.000089  boy
128999  2008   Yurem  0.000089  boy

In [16]:
#create dataset with only john records
john = boy_names[boy_names['name']=='John']
john.head()

      year  name   percent  sex
0     1880  John  0.081541  boy
1000  1881  John  0.080975  boy
2000  1882  John  0.078314  boy
3000  1883  John  0.079066  boy
4000  1884  John  0.076476  boy

In [18]:
john = john.ix[0:, ['year', 'percent']]

In [19]:
#john = john.set_index(['year'])
john.head()

      year   percent
0     1880  0.081541
1000  1881  0.080975
2000  1882  0.078314
3000  1883  0.079066
4000  1884  0.076476

In [22]:
import matplotlib.pyplot as plt
john.plot(color = 'Red')